[
    {
        "id": "1",
        "name": "评测",
        "type": "1",
        "childs": [
            {
                "id": "19",
                "name": "笔记本",
                "type": "1"
            },
            {
                "id": "11",
                "name": "机箱",
                "type": "1"
            },
            {
                "id": "13",
                "name": "处理器",
                "type": "1"
            },
            {
                "id": "14",
                "name": "散热器",
                "type": "1"
            },
            {
                "id": "15",
                "name": "主板",
                "type": "1"
            },
            {
                "id": "18",
                "name": "外设",
                "type": "1"
            },
            {
                "id": "35",
                "name": "电源",
                "type": "1"
            },
            {
                "id": "23",
                "name": "存储",
                "type": "1"
            },
            {
                "id": "21",
                "name": "显示设备",
                "type": "1"
            },
            {
                "id": "88",
                "name": "台式机",
                "type": "1"
            },
            {
                "id": "10",
                "name": "显卡",
                "type": "1"
            },
            {
                "id": "16",
                "name": "相机",
                "type": "1"
            },
            {
                "id": "39",
                "name": "音频",
                "type": "1"
            }
        ]
    },
    {
        "id": "2",
        "name": "电脑",
        "type": "2",
        "childs": [
            {
                "id": "98",
                "name": "配件开箱",
                "type": "2"
            },
            {
                "id": "99",
                "name": "整机搭建",
                "type": "2"
            },
            {
                "id": "100",
                "name": "升级整机",
                "type": "2"
            },
            {
                "id": "101",
                "name": "精品收藏",
                "type": "2"
            }
        ]
    },
    {
        "id": "36",
        "name": "掌设",
        "type": "2",
        "childs": [
            {
                "id": "40",
                "name": "智能手机",
                "type": "2"
            },
            {
                "id": "89",
                "name": "智能手表",
                "type": "2"
            },
            {
                "id": "41",
                "name": "笔电平板",
                "type": "2"
            },
            {
                "id": "92",
                "name": "周边附件",
                "type": "2"
            }
        ]
    },
    {
        "id": "31",
        "name": "摄影",
        "type": "2",
        "childs": [
            {
                "id": "51",
                "name": "单反单电",
                "type": "2"
            },
            {
                "id": "52",
                "name": "微单卡片",
                "type": "2"
            },
            {
                "id": "53",
                "name": "经典旁轴",
                "type": "2"
            },
            {
                "id": "54",
                "name": "怀旧菲林",
                "type": "2"
            },
            {
                "id": "57",
                "name": "影音摄像",
                "type": "2"
            },
            {
                "id": "55",
                "name": "周边附件",
                "type": "2"
            }
        ]
    },
    {
        "id": "3",
        "name": "照片",
        "type": "2",
        "childs": [
            {
                "id": "102",
                "name": "人物肖像",
                "type": "2"
            },
            {
                "id": "103",
                "name": "风景游记",
                "type": "2"
            },
            {
                "id": "104",
                "name": "微距静物",
                "type": "2"
            },
            {
                "id": "105",
                "name": "人文扫街",
                "type": "2"
            },
            {
                "id": "106",
                "name": "动物植物",
                "type": "2"
            },
            {
                "id": "107",
                "name": "其它作品",
                "type": "2"
            }
        ]
    },
    {
        "id": "32",
        "name": "汽车",
        "type": "2",
        "childs": [
            {
                "id": "58",
                "name": "买菜车",
                "type": "2"
            },
            {
                "id": "59",
                "name": "商务车",
                "type": "2"
            },
            {
                "id": "63",
                "name": "性能车",
                "type": "2"
            },
            {
                "id": "60",
                "name": "旅行车",
                "type": "2"
            },
            {
                "id": "61",
                "name": "SUV",
                "type": "2"
            },
            {
                "id": "95",
                "name": "MPV",
                "type": "2"
            },
            {
                "id": "65",
                "name": "摩托轻骑",
                "type": "2"
            },
            {
                "id": "96",
                "name": "改装配件",
                "type": "2"
            }
        ]
    },
    {
        "id": "29",
        "name": "单车",
        "type": "2",
        "childs": [
            {
                "id": "108",
                "name": "山地车",
                "type": "2"
            },
            {
                "id": "109",
                "name": "公路车",
                "type": "2"
            },
            {
                "id": "110",
                "name": "折叠车",
                "type": "2"
            },
            {
                "id": "111",
                "name": "休旅车",
                "type": "2"
            }
        ]
    },
    {
        "id": "30",
        "name": "模型",
        "type": "2",
        "childs": [
            {
                "id": "112",
                "name": "人偶手办",
                "type": "2"
            },
            {
                "id": "113",
                "name": "比例成品",
                "type": "2"
            },
            {
                "id": "114",
                "name": "拼装自组",
                "type": "2"
            },
            {
                "id": "115",
                "name": "RC遥控",
                "type": "2"
            }
        ]
    },
    {
        "id": "33",
        "name": "败家",
        "type": "2",
        "childs": [
            {
                "id": "47",
                "name": "收藏爱好",
                "type": "2"
            },
            {
                "id": "45",
                "name": "品质生活",
                "type": "2"
            },
            {
                "id": "46",
                "name": "数码前沿",
                "type": "2"
            },
            {
                "id": "44",
                "name": "小资情调",
                "type": "2"
            },
            {
                "id": "48",
                "name": "女王最大",
                "type": "2"
            },
            {
                "id": "49",
                "name": "吃喝玩乐",
                "type": "2"
            },
            {
                "id": "87",
                "name": "育儿分享",
                "type": "2"
            }
        ]
    },
    {
        "id": "118",
        "name": "时尚",
        "type": "2",
        "childs": [
            {
                "id": "122",
                "name": "鞋类",
                "type": "2"
            },
            {
                "id": "123",
                "name": "服饰",
                "type": "2"
            },
            {
                "id": "124",
                "name": "箱包",
                "type": "2"
            }
        ]
    },
    {
        "id": "125",
        "name": "腕表",
        "type": "2",
        "childs": [
            {
                "id": "128",
                "name": "机械表",
                "type": "2"
            },
            {
                "id": "126",
                "name": "电子表",
                "type": "2"
            }
        ]
    },
    {
        "id": "66",
        "name": "视听",
        "type": "2",
        "childs": [
            {
                "id": "71",
                "name": "耳机耳放",
                "type": "2"
            },
            {
                "id": "72",
                "name": "音箱功放",
                "type": "2"
            },
            {
                "id": "73",
                "name": "解码转盘",
                "type": "2"
            },
            {
                "id": "74",
                "name": "随身设备",
                "type": "2"
            },
            {
                "id": "75",
                "name": "唱片录音",
                "type": "2"
            }
        ]
    },
    {
        "id": "67",
        "name": "美食",
        "type": "2",
        "childs": [
            {
                "id": "68",
                "name": "当地美味",
                "type": "2"
            },
            {
                "id": "117",
                "name": "世界美食",
                "type": "2"
            },
            {
                "id": "69",
                "name": "私房菜品",
                "type": "2"
            },
            {
                "id": "70",
                "name": "美食器材",
                "type": "2"
            }
        ]
    },
    {
        "id": "132",
        "name": "家居",
        "type": "2",
        "childs": []
    },
    {
        "id": "133",
        "name": "活宠",
        "type": "2",
        "childs": []
    }
]